avr-rust/avrd/packs/atmega/ATmega162.atdf
        <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0xFFFF"/>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="External SRAM Enable" mask="0x80" name="SRE"/>
          <bitfield caption="External SRAM Wait State Select" mask="0x40" name="SRW10"/>
          <bitfield caption="Sleep Enable" mask="0x20" name="SE"/>
          <bitfield caption="Sleep Mode Select" mask="0x10" name="SM1"/>
          <bitfield caption="Interrupt Sense Control 1 bits" mask="0x0C" name="ISC1" values="INTERRUPT_SENSE_CONTROL2"/>
          <bitfield caption="Interrupt Sense Control 0 bits" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL2"/>
        </register>
        <register caption="MCU Control And Status Register" name="MCUCSR" offset="0x54" size="1">
          <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
          <bitfield caption="Sleep Mode Select Bit 2" mask="0x20" name="SM2"/>
          <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Extended MCU Control Register" name="EMCUCR" offset="0x56" size="1">
          <bitfield caption="Sleep mode Select Bit 0" mask="0x80" name="SM0"/>
          <bitfield caption="Wait State Sector Limit Bits" mask="0x70" name="SRL" values="CPU_SECTOR_LIMITS"/>
          <bitfield caption="Wait State Select Bit 1 for Lower Sector" mask="0x0C" name="SRW0" values="CPU_WAIT_STATES"/>
          <bitfield caption="Wait State Select Bit 1 for Upper Sector" mask="0x02" name="SRW11"/>
          <bitfield caption="Interrupt Sense Control 2" mask="0x01" name="ISC2"/>
        </register>
        <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x24" size="1" mask="0x7F">
          <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
        </register>
        <register caption="Clock prescale register" name="CLKPR" offset="0x61" size="1">
          <bitfield caption="Clock Prescaler Change Enable" mask="0x80" name="CLKPCE"/>
          <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS" values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
        </register>
        <register caption="Special Function IO Register" name="SFIOR" offset="0x50" size="1">
          <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="External Memory Bus Keeper Enable" mask="0x40" name="XMBK"/>
          <bitfield caption="External Memory High Mask Bits" mask="0x38" name="XMM"/>
          <bitfield caption="Pull-up Disable" mask="0x04" name="PUD"/>
          <bitfield caption="Prescaler Reset Timer/Counter2" mask="0x02" name="PSR2"/>
          <bitfield caption="Prescaler Reset Timer/Counter3, Timer/Counter1 and Timer/Counter0" mask="0x01" name="PSR310"/>
        </register>
      </register-group>
      <value-group caption="" name="INTERRUPT_SENSE_CONTROL2">
        <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
        <value caption="Any Logical Change in INTX" name="VAL_0x01" value="0x01"/>
        <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
        <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="CPU_SECTOR_LIMITS">
        <value caption="LS = N/A, US = 0x1100 - 0xFFFF" name="VAL_0x00" value="0x00"/>
        <value caption="LS = 0x1100 - 0x1FFF, US = 0x2000 - 0xFFFF" name="VAL_0x01" value="0x01"/>
        <value caption="LS = 0x1100 - 0x3FFF, US = 0x4000 - 0xFFFF" name="VAL_0x02" value="0x02"/>
        <value caption="LS = 0x1100 - 0x5FFF, US = 0x6000 - 0xFFFF" name="VAL_0x03" value="0x03"/>
        <value caption="LS = 0x1100 - 0x7FFF, US = 0x8000 - 0xFFFF" name="VAL_0x04" value="0x04"/>
        <value caption="LS = 0x1100 - 0x9FFF, US = 0xA000 - 0xFFFF" name="VAL_0x05" value="0x05"/>
        <value caption="LS = 0x1100 - 0xBFFF, US = 0xC000 - 0xFFFF" name="VAL_0x06" value="0x06"/>
        <value caption="LS = 0x1100 - 0xDFFF, US = 0xE000 - 0xFFFF" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group caption="" name="CPU_WAIT_STATES">
        <value caption="No wait-states" name="VAL_0x00" value="0x00"/>
        <value caption="Wait one cycle during read/write strobe" name="VAL_0x01" value="0x01"/>
        <value caption="Wait two cycles during read/write strobe" name="VAL_0x02" value="0x02"/>
        <value caption="Wait two cycles during read/write and wait one cycle before driving out new address" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
        <value caption="1" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="4" name="VAL_0x02" value="0x02"/>
        <value caption="8" name="VAL_0x03" value="0x03"/>
        <value caption="16" name="VAL_0x04" value="0x04"/>
        <value caption="32" name="VAL_0x05" value="0x05"/>
        <value caption="64" name="VAL_0x06" value="0x06"/>
        <value caption="128" name="VAL_0x07" value="0x07"/>
        <value caption="256" name="VAL_0x08" value="0x08"/>
      </value-group>
      <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
        <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
      </value-group>
      <parameters>
        <param name="CORE_VERSION" value="V2E"/>
      </parameters>
    </module>
    <module caption="JTAG Interface" name="JTAG">
      <register-group caption="JTAG Interface" name="JTAG">
        <register caption="On-Chip Debug Related Register in I/O Memory" name="OCDR" offset="0x24" size="1" ocd-rw="">
          <bitfield caption="On-Chip Debug Register Bits" mask="0xFF" name="OCDR"/>
        </register>
